desafio-14- Loggers, gzip y analisis performance/src/result_info-log.txt
Phase started: unnamed (index: 0, duration: 1s) 19:46:03(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 19:46:04(-0300)

--------------------------------------
Metrics for period to: 19:46:10(-0300) (width: 6.47s)
--------------------------------------

http.codes.200: ................................................................ 51
http.request_rate: ............................................................. 13/sec
http.requests: ................................................................. 85
http.response_time:
  min: ......................................................................... 6
  max: ......................................................................... 4349
  median: ...................................................................... 10.1
  p95: ......................................................................... 159.2
  p99: ......................................................................... 165.7
http.responses: ................................................................ 51
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 19:46:20(-0300) (width: 8.755s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 3
http.codes.200: ................................................................ 86
http.request_rate: ............................................................. 7/sec
http.requests: ................................................................. 65
http.response_time:
  min: ......................................................................... 1838
  max: ......................................................................... 7008
  median: ...................................................................... 3464.1
  p95: ......................................................................... 6187.2
  p99: ......................................................................... 6976.1
http.responses: ................................................................ 86
vusers.failed: ................................................................. 3


--------------------------------------
Metrics for period to: 19:46:30(-0300) (width: 8.91s)
--------------------------------------

http.codes.200: ................................................................ 132
http.request_rate: ............................................................. 16/sec
http.requests: ................................................................. 143
http.response_time:
  min: ......................................................................... 907
  max: ......................................................................... 2748
  median: ...................................................................... 1790.4
  p95: ......................................................................... 2725
  p99: ......................................................................... 2725
http.responses: ................................................................ 132


--------------------------------------
Metrics for period to: 19:46:40(-0300) (width: 9.069s)
--------------------------------------

http.codes.200: ................................................................ 199
http.request_rate: ............................................................. 22/sec
http.requests: ................................................................. 197
http.response_time:
  min: ......................................................................... 864
  max: ......................................................................... 1860
  median: ...................................................................... 944
  p95: ......................................................................... 1826.6
  p99: ......................................................................... 1863.5
http.responses: ................................................................ 199


--------------------------------------
Metrics for period to: 19:46:50(-0300) (width: 9.909s)
--------------------------------------

http.codes.200: ................................................................ 376
http.request_rate: ............................................................. 40/sec
http.requests: ................................................................. 400
http.response_time:
  min: ......................................................................... 172
  max: ......................................................................... 1849
  median: ...................................................................... 820.7
  p95: ......................................................................... 982.6
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 376
vusers.completed: .............................................................. 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 46491.4
  max: ......................................................................... 46491.4
  median: ...................................................................... 46644.4
  p95: ......................................................................... 46644.4
  p99: ......................................................................... 46644.4


--------------------------------------
Metrics for period to: 19:47:00(-0300) (width: 2.023s)
--------------------------------------

http.codes.200: ................................................................ 102
http.request_rate: ............................................................. 40/sec
http.requests: ................................................................. 56
http.response_time:
  min: ......................................................................... 170
  max: ......................................................................... 868
  median: ...................................................................... 804.5
  p95: ......................................................................... 854.2
  p99: ......................................................................... 854.2
http.responses: ................................................................ 102
vusers.completed: .............................................................. 46
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 46050.1
  max: ......................................................................... 48352.7
  median: ...................................................................... 47586.7
  p95: ......................................................................... 48548.1
  p99: ......................................................................... 48548.1


All VUs finished. Total time: 50 seconds

--------------------------------
Summary report @ 19:46:52(-0300)
--------------------------------

errors.ETIMEDOUT: .............................................................. 3
http.codes.200: ................................................................ 946
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 946
http.response_time:
  min: ......................................................................... 6
  max: ......................................................................... 7008
  median: ...................................................................... 925.4
  p95: ......................................................................... 3464.1
  p99: ......................................................................... 5272.4
http.responses: ................................................................ 946
vusers.completed: .............................................................. 47
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 3
vusers.session_length:
  min: ......................................................................... 46050.1
  max: ......................................................................... 48352.7
  median: ...................................................................... 47586.7
  p95: ......................................................................... 48548.1
  p99: ......................................................................... 48548.1